module.exports = {
    // توكن البوت الخاص بك
    token: "8962956921:AAG9MQSwUZuNl7pPbIRToaRyQhR68_i3PJE",
    
    // قائمة أيديات المطورين (يمكنك إضافة أي عدد من المطورين هنا)
    adminIds: [7715555599, 7766036499],
    
    // يوزر الجروب الأول (البوابة) - بدون علامة @
    group1: "ZXAZAZ", 
    
    // يوزر الجروب الثاني (الذي يتم فيه إضافة الأعضاء) - بدون علامة @
    group2: "ba_w4",
    
    // رابط الجروب السري (الذي يحصل عليه بعد إكمال 50 عضو)
    secretGroupLink: "https://t.me/+Au-wTZaUQdU4MGFk",
    
    // عدد الأعضاء المطلوب إضافتهم للجروب الثاني
    targetMembers: 50
};